org/blog/wiki.org
#+SETUPFILE: ~/repo/blog/tpl/site-tpl.org
#+TITLE: Wiki

这一页是对博客的再分类。

* 身体健康
- [[file:2021/human-tooth.org][关注牙齿健康]]
- [[file:2021/sugar.org][正确食用「糖」]]
- [[file:2021/eyes.org][爱护「眼睛」]]
- 怎么样的饮食习惯，能够帮助我少生大病，有一个精力充沛的身体（与其他生活习惯结合，运动等）
- 耳石症的症状与我所感觉的自己身体的反映不同
- [[file:2021/lack-calcium.org][做哪些事导致缺钙？]]
- [[file:2022/stay-up-late-lead-to-die.org][熬夜增加猝死风险]]
- [[https://view.inews.qq.com/a/20211223A09O3F00][新冠病毒疫苗接种禁忌和注意事项指引（第三版）]]
- [[file:2022/refuse-to-drink.org][酒精致癌]]
- [[https://mp.weixin.qq.com/s/yUf0gSLOUkZPFM68zqpgAA][疫情来时，你家现在的囤货能吃多久？ 这些东西要优先囤！]]
- [[https://mp.weixin.qq.com/s/x8DBt5wCic4UYMmaRQjAXQ][长期熬夜/夜班 + 吃夜宵 = 糖尿病]]
- [[file:2022/medicine-wine.org][吃任何药都不能喝酒，严重会死]]
* 核心技能
** 搜索
- [[file:2021/rules-of-info-by-block.org][My Rules of Information]]
- [[https://www.dianbo.org/9238/stone/google40.htm][Google 搜索从入门到精通]]
- The Joy of Search
- http://www.sowang.com/9238/
- [[file:2021/9238-learn-search.org][搜索引擎 9238 谈怎样学搜索]]
- [[https://www.dianbo.org/9238/index.htm][搜索研究院]]
- [[file:2021/meta-search.org][建立元搜索引擎]]
- [[file:2022/github-code-search.org][GitHub Code Search 搜索语法]]
- 参考资料
  - https://researchbuzz.me/
  - https://www.infotoday.com/searcher/
  - https://www.webmasterworld.com/
** 学习

*** 学习如何学习

- [[file:2021/learning-how-to-learn.org][学习如何学习]]
- [[file:2021/create-knowledge-system.org][建立知识体系]]
- [[file:2021/how-to-know-my-thought.org][如何看到自己的思维方式]]
- [[file:2021/how-to-learn-new-field-by-yourself.org][如何自学一个领域]]
- [[file:2021/positive-psychology-by-tal-ben-shahar.org][积极心理学]]
- [[file:2021/the-craft-of-selfteaching.org][自学是门手艺]] by 李笑来
- [[file:2021/process-of-learning.org][学习的过程]] by [[https://yufree.cn/][于淼]]
- [[file:2021/grasp-a-concept.org][如何真正理解一个新概念]]
- [[file:2021/understanding-understanding.org][理解何谓理解]]

*** 修习 MOOCs&其他课程 目录

| 是否完成（Y/N） | 名称                                                             | 笔记&备注                                                                              |
|-----------------+------------------------------------------------------------------+----------------------------------------------------------------------------------------|
| N               | [[https://www.coursera.org/learn/learning-how-to-learn][Learning How to Learn - Coursera]]                                 | [[file:2021/learning-how-to-learn.org][学习如何学习]]                                                                           |
| N               | [[https://oyc.yale.edu/death/phil-176][Death -  Yale University]]                                         | https://www.bilibili.com/video/BV1V3411k7Q1                                            |
| N               | [[https://www.bilibili.com/video/BV1kx411S7ZU][积极心理学 -  哈佛大学]]                                           | [[file:2021/positive-psychology-by-tal-ben-shahar.org][积极心理学]]                                                                             |
| N               | [[https://www.bilibili.com/video/BV1Gt411G7L2][数学的思维方式与创新 - 丘维声]]                                    | [[file:2021/math-think-innovate.org][数学的思维方式与创新]]                                                                   |
| N               | [[https://mitpress.mit.edu/sicp/][计算机程序的构造和解释(SICP)]]                                     | [[https://www.bilibili.com/video/BV1Xx41117tr]] [[https://github.com/DeathKing/Learning-SICP]] |
| N               | [[https://www.bilibili.com/video/BV1Mt411s7Wi][MIT 6-042J Mathematics for Computer Science 计算机科学领域的数学]] |                                                                                        |
| N               | [[https://www.bilibili.com/video/BV1zs411h7t8][斯坦福大学公开课：编程方法学 28 集全]]                             |                                                                                        |
| N               | [[https://www.bilibili.com/video/BV1Tb411M7FA][算法导论-麻省理工]]                                                |                                                                                        |
| N               | [[https://www.bilibili.com/video/BV1kf4y1t7vq][从爱因斯坦到霍金的宇宙]]                                           |                                                                                        |
| N               | [[https://mp.weixin.qq.com/s/tmJsFYND7bBLHM9e9lCuwA][吕鹏：计算社会科学]]                                               |                                                                                        |

*** 其他参考

- https://github.com/yufree/MOOC

** 共情（[[https://psychology.knowyourself.cc/material][心理学]]）
*** 心理学必修课
1. 心理学导论
  - 耶鲁大学公开课：心理学导论（来自网易公开课）
  - 书：心理学与生活
2. 心理诊断学
  - 变态心理学 - 北京大学钱铭怡
  - Crash Course：10 分钟心理学速成 – 心理障碍/精神疾病（来自网易公开课）
  - 书：身体从未忘记、精神障碍诊断与统计手册(第 5 版)
3. 认知心理学
  - 感觉与知觉 - 台湾清华大学（来自中国大学 MOOC）
  - 书：《认知心理学》，R. L. Solso / M. K. MacLin / O. H. MacLin
4. 社会心理学
  - 华东师范大学公开课：诠释社会、解读生活——社会心理学（来自网易云课堂）
  - 书：社交天性：人类社交的三大驱动力、关系性存在：超越自我与共同体
5. 发展心理学
  - 马里兰大学巴尔的摩郡分校：儿童发展心理学（来自网易公开课）
  - 书：儿童发展心理学：费尔德曼带你开启孩子的成长之旅、孩子的世界、发展心理学：儿童与青少年
6. 心理咨询
  - 手把手教你心理咨询：谈话的艺术 - 南京大学陈昌凯（来自中国大学 MOOC）
  - 书：心理咨询面谈技术
