blog/wiki.html
<!DOCTYPE html>
<html lang="zh">
<head>
<!-- 2022-02-08 Tue 09:01 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Wiki</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/highlightjs/cdn-release@11.4.0/build/styles/base16/dracula.min.css">
<link rel="stylesheet" href="/theme/site.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">Wiki</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org3fe5a83">1. 身体健康</a></li>
<li><a href="#org76e79ab">2. 核心技能</a>
<ul>
<li><a href="#org7e3ab0a">2.1. 搜索</a></li>
<li><a href="#org638c2de">2.2. 学习</a>
<ul>
<li><a href="#org576907b">2.2.1. 学习如何学习</a></li>
<li><a href="#org7b253ce">2.2.2. 修习 MOOCs&amp;其他课程 目录</a></li>
<li><a href="#orgc2ac335">2.2.3. 其他参考</a></li>
</ul>
</li>
<li><a href="#org0335681">2.3. 共情（心理学）</a>
<ul>
<li><a href="#org1349660">2.3.1. 心理学必修课</a></li>
<li><a href="#org6acfb4c">2.3.2. 升级选修课</a></li>
<li><a href="#org5d9e9e4">2.3.3. 丰富精神世界</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgd85191a">3. 思维意识</a>
<ul>
<li><a href="#org8f57e13">3.1. 批判性思维</a></li>
<li><a href="#org8a0e49f">3.2. 自我价值</a></li>
</ul>
</li>
<li><a href="#org44d3bbf">4. 社会实践</a>
<ul>
<li><a href="#org631aa25">4.1. 环境保护</a></li>
</ul>
</li>
<li><a href="#org576afe2">5. 技术探索</a>
<ul>
<li><a href="#org727fa65">5.1. 关于技术的思考</a></li>
<li><a href="#org23114c1">5.2. 工作</a></li>
<li><a href="#orgb167ace">5.3. LeetCode</a></li>
<li><a href="#org4cc779b">5.4. 安全</a></li>
<li><a href="#org79dadb5">5.5. Web</a></li>
<li><a href="#org1617b62">5.6. 字符编码</a></li>
<li><a href="#org0763748">5.7. Emacs</a></li>
<li><a href="#orge739f1b">5.8. VS Code</a></li>
<li><a href="#org3becdfb">5.9. Git</a></li>
<li><a href="#orgd5427b9">5.10. 工具</a></li>
<li><a href="#org9e0e60d">5.11. SSH</a></li>
<li><a href="#orgfbe57b0">5.12. Nginx</a></li>
<li><a href="#orgde07d15">5.13. KDE</a></li>
</ul>
</li>
</ul>
</div>
</nav>
<p>
这一页是对博客的再分类。
</p>

<div id="outline-container-org3fe5a83" class="outline-2">
<h2 id="org3fe5a83"><span class="section-number-2">1</span> 身体健康</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><a href="2021/human-tooth.html">关注牙齿健康</a></li>
<li><a href="2021/sugar.html">正确食用「糖」</a></li>
<li><a href="2021/eyes.html">爱护「眼睛」</a></li>
<li>怎么样的饮食习惯，能够帮助我少生大病，有一个精力充沛的身体（与其他生活习惯结合，运动等）</li>
<li>耳石症的症状与我所感觉的自己身体的反映不同</li>
<li><a href="2021/lack-calcium.html">做哪些事导致缺钙？</a></li>
<li><a href="2022/stay-up-late-lead-to-die.html">熬夜增加猝死风险</a></li>
<li><a href="https://view.inews.qq.com/a/20211223A09O3F00">新冠病毒疫苗接种禁忌和注意事项指引（第三版）</a></li>
<li><a href="2022/refuse-to-drink.html">酒精致癌</a></li>
<li><a href="https://mp.weixin.qq.com/s/yUf0gSLOUkZPFM68zqpgAA">疫情来时，你家现在的囤货能吃多久？ 这些东西要优先囤！</a></li>
<li><a href="https://mp.weixin.qq.com/s/x8DBt5wCic4UYMmaRQjAXQ">长期熬夜/夜班 + 吃夜宵 = 糖尿病</a></li>
<li><a href="2022/medicine-wine.html">吃任何药都不能喝酒，严重会死</a></li>
</ul>
</div>
</div>
<div id="outline-container-org76e79ab" class="outline-2">
<h2 id="org76e79ab"><span class="section-number-2">2</span> 核心技能</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org7e3ab0a" class="outline-3">
<h3 id="org7e3ab0a"><span class="section-number-3">2.1</span> 搜索</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li><a href="2021/rules-of-info-by-block.html">My Rules of Information</a></li>
<li><a href="https://www.dianbo.org/9238/stone/google40.htm">Google 搜索从入门到精通</a></li>
<li>The Joy of Search</li>
<li><a href="http://www.sowang.com/9238/">http://www.sowang.com/9238/</a></li>
<li><a href="2021/9238-learn-search.html">搜索引擎 9238 谈怎样学搜索</a></li>
<li><a href="https://www.dianbo.org/9238/index.htm">搜索研究院</a></li>
<li><a href="2021/meta-search.html">建立元搜索引擎</a></li>
<li><a href="2022/github-code-search.html">GitHub Code Search 搜索语法</a></li>
<li>参考资料
<ul class="org-ul">
<li><a href="https://researchbuzz.me/">https://researchbuzz.me/</a></li>
<li><a href="https://www.infotoday.com/searcher/">https://www.infotoday.com/searcher/</a></li>
<li><a href="https://www.webmasterworld.com/">https://www.webmasterworld.com/</a></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org638c2de" class="outline-3">
<h3 id="org638c2de"><span class="section-number-3">2.2</span> 学习</h3>
<div class="outline-text-3" id="text-2-2">
</div>
<div id="outline-container-org576907b" class="outline-4">
<h4 id="org576907b"><span class="section-number-4">2.2.1</span> 学习如何学习</h4>
<div class="outline-text-4" id="text-2-2-1">
<ul class="org-ul">
<li><a href="2021/learning-how-to-learn.html">学习如何学习</a></li>
<li><a href="2021/create-knowledge-system.html">建立知识体系</a></li>
<li><a href="2021/how-to-know-my-thought.html">如何看到自己的思维方式</a></li>
<li><a href="2021/how-to-learn-new-field-by-yourself.html">如何自学一个领域</a></li>
<li><a href="2021/positive-psychology-by-tal-ben-shahar.html">积极心理学</a></li>
<li><a href="2021/the-craft-of-selfteaching.html">自学是门手艺</a> by 李笑来</li>
<li><a href="2021/process-of-learning.html">学习的过程</a> by <a href="https://yufree.cn/">于淼</a></li>
<li><a href="2021/grasp-a-concept.html">如何真正理解一个新概念</a></li>
<li><a href="2021/understanding-understanding.html">理解何谓理解</a></li>
</ul>
</div>
</div>

<div id="outline-container-org7b253ce" class="outline-4">
<h4 id="org7b253ce"><span class="section-number-4">2.2.2</span> 修习 MOOCs&amp;其他课程 目录</h4>
<div class="outline-text-4" id="text-2-2-2">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">是否完成（Y/N）</th>
<th scope="col" class="org-left">名称</th>
<th scope="col" class="org-left">笔记&amp;备注</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">N</td>
<td class="org-left"><a href="https://www.coursera.org/learn/learning-how-to-learn">Learning How to Learn - Coursera</a></td>
<td class="org-left"><a href="2021/learning-how-to-learn.html">学习如何学习</a></td>
</tr>

<tr>
<td class="org-left">N</td>
<td class="org-left"><a href="https://oyc.yale.edu/death/phil-176">Death -  Yale University</a></td>
<td class="org-left"><a href="https://www.bilibili.com/video/BV1V3411k7Q1">https://www.bilibili.com/video/BV1V3411k7Q1</a></td>
</tr>

<tr>
<td class="org-left">N</td>
<td class="org-left"><a href="https://www.bilibili.com/video/BV1kx411S7ZU">积极心理学 -  哈佛大学</a></td>
<td class="org-left"><a href="2021/positive-psychology-by-tal-ben-shahar.html">积极心理学</a></td>
</tr>

<tr>
<td class="org-left">N</td>
<td class="org-left"><a href="https://www.bilibili.com/video/BV1Gt411G7L2">数学的思维方式与创新 - 丘维声</a></td>
<td class="org-left"><a href="2021/math-think-innovate.html">数学的思维方式与创新</a></td>
</tr>

<tr>
<td class="org-left">N</td>
<td class="org-left"><a href="https://mitpress.mit.edu/sicp/">计算机程序的构造和解释(SICP)</a></td>
<td class="org-left"><a href="https://www.bilibili.com/video/BV1Xx41117tr">https://www.bilibili.com/video/BV1Xx41117tr</a> <a href="https://github.com/DeathKing/Learning-SICP">https://github.com/DeathKing/Learning-SICP</a></td>
</tr>

<tr>
<td class="org-left">N</td>
<td class="org-left"><a href="https://www.bilibili.com/video/BV1Mt411s7Wi">MIT 6-042J Mathematics for Computer Science 计算机科学领域的数学</a></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">N</td>
<td class="org-left"><a href="https://www.bilibili.com/video/BV1zs411h7t8">斯坦福大学公开课：编程方法学 28 集全</a></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">N</td>
<td class="org-left"><a href="https://www.bilibili.com/video/BV1Tb411M7FA">算法导论-麻省理工</a></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">N</td>
<td class="org-left"><a href="https://www.bilibili.com/video/BV1kf4y1t7vq">从爱因斯坦到霍金的宇宙</a></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">N</td>
<td class="org-left"><a href="https://mp.weixin.qq.com/s/tmJsFYND7bBLHM9e9lCuwA">吕鹏：计算社会科学</a></td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgc2ac335" class="outline-4">
<h4 id="orgc2ac335"><span class="section-number-4">2.2.3</span> 其他参考</h4>
<div class="outline-text-4" id="text-2-2-3">
<ul class="org-ul">
<li><a href="https://github.com/yufree/MOOC">https://github.com/yufree/MOOC</a></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org0335681" class="outline-3">
<h3 id="org0335681"><span class="section-number-3">2.3</span> 共情（<a href="https://psychology.knowyourself.cc/material">心理学</a>）</h3>
<div class="outline-text-3" id="text-2-3">
</div>
<div id="outline-container-org1349660" class="outline-4">
<h4 id="org1349660"><span class="section-number-4">2.3.1</span> 心理学必修课</h4>
<div class="outline-text-4" id="text-2-3-1">
<ol class="org-ol">
<li>心理学导论
<ul class="org-ul">
<li>耶鲁大学公开课：心理学导论（来自网易公开课）</li>
<li>书：心理学与生活</li>
</ul></li>
<li>心理诊断学
<ul class="org-ul">
<li>变态心理学 - 北京大学钱铭怡</li>
<li>Crash Course：10 分钟心理学速成 – 心理障碍/精神疾病（来自网易公开课）</li>
<li>书：身体从未忘记、精神障碍诊断与统计手册(第 5 版)</li>
</ul></li>
<li>认知心理学
<ul class="org-ul">
<li>感觉与知觉 - 台湾清华大学（来自中国大学 MOOC）</li>
<li>书：《认知心理学》，R. L. Solso / M. K. MacLin / O. H. MacLin</li>
</ul></li>
<li>社会心理学
<ul class="org-ul">
<li>华东师范大学公开课：诠释社会、解读生活——社会心理学（来自网易云课堂）</li>
<li>书：社交天性：人类社交的三大驱动力、关系性存在：超越自我与共同体</li>
</ul></li>
<li>发展心理学
<ul class="org-ul">
<li>马里兰大学巴尔的摩郡分校：儿童发展心理学（来自网易公开课）</li>
<li>书：儿童发展心理学：费尔德曼带你开启孩子的成长之旅、孩子的世界、发展心理学：儿童与青少年</li>
</ul></li>
<li>心理咨询
<ul class="org-ul">
<li>手把手教你心理咨询：谈话的艺术 - 南京大学陈昌凯（来自中国大学 MOOC）</li>
<li>书：心理咨询面谈技术</li>
</ul></li>
</ol>
</div>
</div>
