org/blog/wiki.org
*** 升级选修课
1. 心理动力学流派
  - 【BBC/精神分析】探求自我的世纪 The Century of the Self
  - 复旦大学 《精神分析引论》导读 全 46 讲 主讲-陈学明
  - 心理动力学最前沿的内容，神经精神分析创始人 Mark Solms 主讲的免费公开课：开普敦大学公开课：心智是什么（来自 FutureLearn 平台）
  - 《寻找弗洛伊德：精神分析理论与经典案例（修订版）》作者：李武石
  - 心理动力学心理治疗简明指南
  - 精神分析案例解析（万千心理）
  - 梦的解析
  - 精神分析引论
  - 嫉羨与感恩
  - 儿童精神分析
  - 婴儿与母亲
  - 人类本性
  - 依恋三部曲
2. 认知行为流派
  - 中南大学公开课：神经症与心理治疗（来自网易公开课）
  - University of Reading: Understanding Anxiety, Depression and CBT（来自 FutureLearn）
  - 认知疗法基础与应用
  - 《控制焦虑》，《控制愤怒》，《理性情绪》
3. 存在人本主义流派（存在主义哲学、死亡）
  - 存在主义大师欧文·亚隆治疗与教学相关视频（来自 psychotherapy.net 亚隆之子创办）
  - 耶鲁大学公开课：哲学与死亡
  - 华东理工大学 “身”的无意识原型与存在主义心理学 全 7 讲 主讲-罗建平
  - 焦虑的意义
  - 活出生命的意义
  - 存在主义心理治疗
  - 论人的成长
  - 当事人中心治疗：实践、运用和理论
4. 家庭治疗
  - 加州大学洛杉矶分校：家庭与夫妇心理学-亲密关系（来自网易公开课）
  - 家庭与家庭治疗
  - 客体关系家庭治疗
  - 萨提亚家庭治疗模式
5. 积极心理学
  - 哈佛大学公开课：幸福课积极心理学（来自优酷公开课）
  - 《积极心理学》作者: 【爱尔兰】Alan Carr
  - 《积极心理学》作者: C.R.斯奈德 (Snyder C.R.) / 沙恩·洛佩斯 (Lopez S.J.)
6. 危机干预与创伤修复
  - 约翰霍普金斯大学公开课：心理急救 Psychological First Aid
  - 哀伤治疗：陪伴丧亲者走过幽谷之路
  - 创伤治疗——精神分析取向
  - 危机干预策略
7. 团体心理治疗

团体心理治疗：一般是由 1~2 名治疗师主持，治疗对象可由 8~15 名具有相同或不同问题的成员组成。治疗以聚会的方式出现，可每周 1 次，每次时间 1.5~2 小时，治疗次数可视患者的具体问题和具体情况而定。在治疗期间，团体成员就大家所共同关心的问题进行讨论，观察和分析有关自己和他人的心理与行为反应、情感体验和人际关系，从而使自己的行为得以改善。

  - 《团体心理治疗》作者: (美)欧文·亚隆
  - 《心理动力学团体分析》作者: 哈罗德·贝尔 / 莉赛尔·赫
*** 丰富精神世界
1. 博雅教育公开课视频推荐
  - [[https://space.bilibili.com/1950746][B 站 Up 主：白花恋诗·彩，翻译众多课程]]
  - 拜欧拉大学公开课：性别与传播研究（来自网易公开课）
  - 耶鲁大学公开课：文学理论导论（来自网易公开课）名字叫文学理论，其实讲的是哲学、心理学、政治、艺术等等。
  - 国家大剧院：音乐虫聊天室（找不到他们的节目了，不过国家大剧院——很不错的欣赏音乐的地方），非常好听的古典音乐介绍类音频节目
  - 北京大学公开课：艺术史（来自网易公开课）
  - 清华大学公开课：东西方现代艺术（来自网易公开课）
  - 耶鲁大学公开课：人性的哲学与科学（来自网易公开课）
  - 牛津大学开放课程：哲学概论（来自网易公开课）
  - 哈佛大学公开课：公正-该如何做是好？
2. 推荐书目
  - 《美的历程》，李泽厚
  - 《乡土中国 生育制度》费孝通
  - 《西方哲学简史》，（英） 伯特兰·罗素
  - 《万历十五年》，（美）黄仁宇
  - 《登天之梯 : 一个儿童心理咨询师的诊疗笔记》，（美）布鲁斯·D·佩里等
  - 《给一个青年诗人的十封信》里尔克
  - 《全球通史》，（美）L·S·斯塔夫里阿诺斯
  - 《少女杜拉的故事》，（奥地利）西格蒙德·弗洛伊德
  - 《社会契约论》， （法）让-雅克·卢梭
  - 《时间的玫瑰》，北岛
  - 《规训与惩罚》，（法）米歇尔·福柯
* 思维意识
** 批判性思维
1. [[file:2020/critical-thinking-0.org][批判性思维：定义及价值]]
2. [[file:2020/critical-thinking-1.org][批判性思维：批判精神与理性美德]]
3. [[file:2020/critical-thinking-2.org][批判性思维：思维品质和思维技能]]
4. [[file:2020/critical-thinking-3.org][批判性思维：批判性阅读的方法和实践]]
** 自我价值
- [[file:2021/build-self-worth.org][建构自我价值]]
* 社会实践
- [[file:2022/legality-of-recording.org][录音的合法性]]
** 环境保护
- [[file:2022/carbon-tipping-points-our-solutions.org][Carbon, tipping points & our simplest solutions]] 未完成
* 技术探索

[[file:coding.org][索引]]
** 关于技术的思考
- [[file:2022/tech-thought-1.org][技术遐想（一）]]
** 工作
- [[file:2022/contract-agreement.org][谨慎对待合同协议]]
** LeetCode

| Title                             | Difficulty |
|-----------------------------------+------------|
| [[file:2021/lc-1-two-sum.org][LC1. 两数之和]]                     | 简单       |
| [[file:2021/lc-167-two-sum-ii-input-array-is-sorted.org][LC167. 两数之和 II - 输入有序数组]] | 简单       |
| [[file:2021/lc-453-minimum-moves-to-equal-array-elements.org][LC453. 最小操作次数使数组元素相等]] | 简单       |
| [[file:2021/lc-26-remove-duplicates-from-sorted-array.org][LC26. 删除有序数组中的重复项]]      | 简单       |
| [[file:2021/lc-122-best-time-to-buy-and-sell-stock-ii.org][LC122. 买卖股票的最佳时机 II]]       | 中等       |
| [[file:2021/lc-189-rotate-array.org][LC189. 旋转数组]]                   | 中等       |
| [[file:2021/lc-217-contains-duplicate.oorg][LC217. 存在重复元素]]               | 简单       |
| [[file:2021/lc-94-binary-tree-inorder-traversal.org][LC94. 二叉树的中序遍历]]            | 简单       |
| [[file:2021/lc-20-valid-parentheses.org][LC20. 有效的括号]]                  | 简单       |
| [[file:2021/lc-96-unique-binary-search-trees.org][LC96. 不同的二叉搜索树]]            | 中等       |
| [[file:2021/lc-101-symmetric-tree.org][LC101. 对称二叉树]]                 | 简单       |
| [[file:2021/lc-17-letter-combinations-of-a-phone-number.org][LC17. 电话号码的字母组合]]          | 中等       |

** 安全
** Web
- [[file:2021/sky-cloud.org][Draw Sky, Cloud]]
- Firefox
  - [[https://developer.mozilla.org/en-US/docs/Tools/Keyboard_shortcuts][开发者工具快捷键]]
  - [[https://support.mozilla.org/en-US/kb/keyboard-shortcuts-perform-firefox-tasks-quickly][Firefox 浏览器快捷键]]
- JavaScript
  - [[file:blog/2021/js-string.org][JS 字符串]]
  - [[file:2022/dom-scripting.org][DOM Scripting]]
** 字符编码

UTF-8, UTF-16(JavaScript)
- [[https://web.archive.org/web/20210515223728/http://www.imkevinyang.com/2010/06/%E5%85%B3%E4%BA%8E%E5%AD%97%E7%AC%A6%E7%BC%96%E7%A0%81%EF%BC%8C%E4%BD%A0%E6%89%80%E9%9C%80%E8%A6%81%E7%9F%A5%E9%81%93%E7%9A%84.html][关于字符编码，你所需要知道的（ASCII,Unicode,Utf-8,GB2312…）]]
- [[https://www.joelonsoftware.com/2003/10/08/the-absolute-minimum-every-software-developer-absolutely-positively-must-know-about-unicode-and-character-sets-no-excuses/][The Absolute Minimum Every Software Developer Absolutely, Positively Must Know About Unicode and Character Sets (No Excuses!)]]
- [[https://mathiasbynens.be/notes/javascript-encoding][JavaScript’s internal character encoding: UCS-2 or UTF-16?]]

** Emacs
- [[file:2021/emacs-common-keyboard-shortcuts.org][Emacs 常用快捷键总结]]
- Org Mode
  - [[file:2021/bold-in-org-mode.org][Bold in Org-mode]]
  - [[file:2021/org-mode-macro.org][使用 Org-mode 为文本添加高亮]]
  - [[file:2021/org-mode-export-pdf.org][Emacs 下将 Org 导出为 pdf]]
  - [[file:2022/org-mode-publish-with-crontab.org][自动发布 Org Mode]]
** VS Code
- [[https://code.visualstudio.com/shortcuts/keyboard-shortcuts-linux.pdf][Keyboard shortcuts for Linux - Visual Studio Code]]
** Git
- [[file:2021/git-credential.org][Git Credential]]
- [[file:2021/git-server-hook.org][云服务器配置 Git 仓库托管并使用 Git Hooks 自动执行脚本]]
