blog/wiki.html
<div id="outline-container-org6acfb4c" class="outline-4">
<h4 id="org6acfb4c"><span class="section-number-4">2.3.2</span> 升级选修课</h4>
<div class="outline-text-4" id="text-2-3-2">
<ol class="org-ol">
<li>心理动力学流派
<ul class="org-ul">
<li>【BBC/精神分析】探求自我的世纪 The Century of the Self</li>
<li>复旦大学 《精神分析引论》导读 全 46 讲 主讲-陈学明</li>
<li>心理动力学最前沿的内容，神经精神分析创始人 Mark Solms 主讲的免费公开课：开普敦大学公开课：心智是什么（来自 FutureLearn 平台）</li>
<li>《寻找弗洛伊德：精神分析理论与经典案例（修订版）》作者：李武石</li>
<li>心理动力学心理治疗简明指南</li>
<li>精神分析案例解析（万千心理）</li>
<li>梦的解析</li>
<li>精神分析引论</li>
<li>嫉羨与感恩</li>
<li>儿童精神分析</li>
<li>婴儿与母亲</li>
<li>人类本性</li>
<li>依恋三部曲</li>
</ul></li>
<li>认知行为流派
<ul class="org-ul">
<li>中南大学公开课：神经症与心理治疗（来自网易公开课）</li>
<li>University of Reading: Understanding Anxiety, Depression and CBT（来自 FutureLearn）</li>
<li>认知疗法基础与应用</li>
<li>《控制焦虑》，《控制愤怒》，《理性情绪》</li>
</ul></li>
<li>存在人本主义流派（存在主义哲学、死亡）
<ul class="org-ul">
<li>存在主义大师欧文·亚隆治疗与教学相关视频（来自 psychotherapy.net 亚隆之子创办）</li>
<li>耶鲁大学公开课：哲学与死亡</li>
<li>华东理工大学 “身”的无意识原型与存在主义心理学 全 7 讲 主讲-罗建平</li>
<li>焦虑的意义</li>
<li>活出生命的意义</li>
<li>存在主义心理治疗</li>
<li>论人的成长</li>
<li>当事人中心治疗：实践、运用和理论</li>
</ul></li>
<li>家庭治疗
<ul class="org-ul">
<li>加州大学洛杉矶分校：家庭与夫妇心理学-亲密关系（来自网易公开课）</li>
<li>家庭与家庭治疗</li>
<li>客体关系家庭治疗</li>
<li>萨提亚家庭治疗模式</li>
</ul></li>
<li>积极心理学
<ul class="org-ul">
<li>哈佛大学公开课：幸福课积极心理学（来自优酷公开课）</li>
<li>《积极心理学》作者: 【爱尔兰】Alan Carr</li>
<li>《积极心理学》作者: C.R.斯奈德 (Snyder C.R.) / 沙恩·洛佩斯 (Lopez S.J.)</li>
</ul></li>
<li>危机干预与创伤修复
<ul class="org-ul">
<li>约翰霍普金斯大学公开课：心理急救 Psychological First Aid</li>
<li>哀伤治疗：陪伴丧亲者走过幽谷之路</li>
<li>创伤治疗——精神分析取向</li>
<li>危机干预策略</li>
</ul></li>
<li>团体心理治疗</li>
</ol>

<p>
团体心理治疗：一般是由 1~2 名治疗师主持，治疗对象可由 8~15 名具有相同或不同问题的成员组成。治疗以聚会的方式出现，可每周 1 次，每次时间 1.5~2 小时，治疗次数可视患者的具体问题和具体情况而定。在治疗期间，团体成员就大家所共同关心的问题进行讨论，观察和分析有关自己和他人的心理与行为反应、情感体验和人际关系，从而使自己的行为得以改善。
</p>

<ul class="org-ul">
<li>《团体心理治疗》作者: (美)欧文·亚隆</li>
<li>《心理动力学团体分析》作者: 哈罗德·贝尔 / 莉赛尔·赫</li>
</ul>
</div>
</div>
<div id="outline-container-org5d9e9e4" class="outline-4">
<h4 id="org5d9e9e4"><span class="section-number-4">2.3.3</span> 丰富精神世界</h4>
<div class="outline-text-4" id="text-2-3-3">
<ol class="org-ol">
<li>博雅教育公开课视频推荐
<ul class="org-ul">
<li><a href="https://space.bilibili.com/1950746">B 站 Up 主：白花恋诗·彩，翻译众多课程</a></li>
<li>拜欧拉大学公开课：性别与传播研究（来自网易公开课）</li>
<li>耶鲁大学公开课：文学理论导论（来自网易公开课）名字叫文学理论，其实讲的是哲学、心理学、政治、艺术等等。</li>
<li>国家大剧院：音乐虫聊天室（找不到他们的节目了，不过国家大剧院——很不错的欣赏音乐的地方），非常好听的古典音乐介绍类音频节目</li>
<li>北京大学公开课：艺术史（来自网易公开课）</li>
<li>清华大学公开课：东西方现代艺术（来自网易公开课）</li>
<li>耶鲁大学公开课：人性的哲学与科学（来自网易公开课）</li>
<li>牛津大学开放课程：哲学概论（来自网易公开课）</li>
<li>哈佛大学公开课：公正-该如何做是好？</li>
</ul></li>
<li>推荐书目
<ul class="org-ul">
<li>《美的历程》，李泽厚</li>
<li>《乡土中国 生育制度》费孝通</li>
<li>《西方哲学简史》，（英） 伯特兰·罗素</li>
<li>《万历十五年》，（美）黄仁宇</li>
<li>《登天之梯 : 一个儿童心理咨询师的诊疗笔记》，（美）布鲁斯·D·佩里等</li>
<li>《给一个青年诗人的十封信》里尔克</li>
<li>《全球通史》，（美）L·S·斯塔夫里阿诺斯</li>
<li>《少女杜拉的故事》，（奥地利）西格蒙德·弗洛伊德</li>
<li>《社会契约论》， （法）让-雅克·卢梭</li>
<li>《时间的玫瑰》，北岛</li>
<li>《规训与惩罚》，（法）米歇尔·福柯</li>
</ul></li>
</ol>
</div>
</div>
</div>
</div>
<div id="outline-container-orgd85191a" class="outline-2">
<h2 id="orgd85191a"><span class="section-number-2">3</span> 思维意识</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org8f57e13" class="outline-3">
<h3 id="org8f57e13"><span class="section-number-3">3.1</span> 批判性思维</h3>
<div class="outline-text-3" id="text-3-1">
<ol class="org-ol">
<li><a href="2020/critical-thinking-0.html">批判性思维：定义及价值</a></li>
<li><a href="2020/critical-thinking-1.html">批判性思维：批判精神与理性美德</a></li>
<li><a href="2020/critical-thinking-2.html">批判性思维：思维品质和思维技能</a></li>
<li><a href="2020/critical-thinking-3.html">批判性思维：批判性阅读的方法和实践</a></li>
</ol>
</div>
</div>
<div id="outline-container-org8a0e49f" class="outline-3">
<h3 id="org8a0e49f"><span class="section-number-3">3.2</span> 自我价值</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li><a href="2021/build-self-worth.html">建构自我价值</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org44d3bbf" class="outline-2">
<h2 id="org44d3bbf"><span class="section-number-2">4</span> 社会实践</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li><a href="2022/legality-of-recording.html">录音的合法性</a></li>
</ul>
</div>
<div id="outline-container-org631aa25" class="outline-3">
<h3 id="org631aa25"><span class="section-number-3">4.1</span> 环境保护</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li><a href="2022/carbon-tipping-points-our-solutions.html">Carbon, tipping points &amp; our simplest solutions</a> 未完成</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org576afe2" class="outline-2">
<h2 id="org576afe2"><span class="section-number-2">5</span> 技术探索</h2>
<div class="outline-text-2" id="text-5">
<p>
<a href="coding.html">索引</a>
</p>
</div>
<div id="outline-container-org727fa65" class="outline-3">
<h3 id="org727fa65"><span class="section-number-3">5.1</span> 关于技术的思考</h3>
<div class="outline-text-3" id="text-5-1">
<ul class="org-ul">
<li><a href="2022/tech-thought-1.html">技术遐想（一）</a></li>
</ul>
</div>
</div>
<div id="outline-container-org23114c1" class="outline-3">
<h3 id="org23114c1"><span class="section-number-3">5.2</span> 工作</h3>
<div class="outline-text-3" id="text-5-2">
<ul class="org-ul">
<li><a href="2022/contract-agreement.html">谨慎对待合同协议</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgb167ace" class="outline-3">
<h3 id="orgb167ace"><span class="section-number-3">5.3</span> LeetCode</h3>
<div class="outline-text-3" id="text-5-3">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Title</th>
<th scope="col" class="org-left">Difficulty</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><a href="2021/lc-1-two-sum.html">LC1. 两数之和</a></td>
<td class="org-left">简单</td>
</tr>

<tr>
<td class="org-left"><a href="2021/lc-167-two-sum-ii-input-array-is-sorted.html">LC167. 两数之和 II - 输入有序数组</a></td>
<td class="org-left">简单</td>
</tr>

<tr>
<td class="org-left"><a href="2021/lc-453-minimum-moves-to-equal-array-elements.html">LC453. 最小操作次数使数组元素相等</a></td>
<td class="org-left">简单</td>
</tr>

<tr>
<td class="org-left"><a href="2021/lc-26-remove-duplicates-from-sorted-array.html">LC26. 删除有序数组中的重复项</a></td>
<td class="org-left">简单</td>
</tr>

<tr>
<td class="org-left"><a href="2021/lc-122-best-time-to-buy-and-sell-stock-ii.html">LC122. 买卖股票的最佳时机 II</a></td>
<td class="org-left">中等</td>
</tr>

<tr>
<td class="org-left"><a href="2021/lc-189-rotate-array.html">LC189. 旋转数组</a></td>
<td class="org-left">中等</td>
</tr>

<tr>
<td class="org-left"><a href="2021/lc-217-contains-duplicate.oorg">LC217. 存在重复元素</a></td>
<td class="org-left">简单</td>
</tr>

<tr>
<td class="org-left"><a href="2021/lc-94-binary-tree-inorder-traversal.html">LC94. 二叉树的中序遍历</a></td>
<td class="org-left">简单</td>
</tr>

<tr>
<td class="org-left"><a href="2021/lc-20-valid-parentheses.html">LC20. 有效的括号</a></td>
<td class="org-left">简单</td>
</tr>

<tr>
<td class="org-left"><a href="2021/lc-96-unique-binary-search-trees.html">LC96. 不同的二叉搜索树</a></td>
<td class="org-left">中等</td>
</tr>

<tr>
<td class="org-left"><a href="2021/lc-101-symmetric-tree.html">LC101. 对称二叉树</a></td>
<td class="org-left">简单</td>
</tr>

<tr>
<td class="org-left"><a href="2021/lc-17-letter-combinations-of-a-phone-number.html">LC17. 电话号码的字母组合</a></td>
<td class="org-left">中等</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org4cc779b" class="outline-3">
<h3 id="org4cc779b"><span class="section-number-3">5.4</span> 安全</h3>
</div>
<div id="outline-container-org79dadb5" class="outline-3">
<h3 id="org79dadb5"><span class="section-number-3">5.5</span> Web</h3>
<div class="outline-text-3" id="text-5-5">
<ul class="org-ul">
<li><a href="2021/sky-cloud.html">Draw Sky, Cloud</a></li>
<li>Firefox
<ul class="org-ul">
<li><a href="https://developer.mozilla.org/en-US/docs/Tools/Keyboard_shortcuts">开发者工具快捷键</a></li>
<li><a href="https://support.mozilla.org/en-US/kb/keyboard-shortcuts-perform-firefox-tasks-quickly">Firefox 浏览器快捷键</a></li>
</ul></li>
<li>JavaScript
<ul class="org-ul">
<li><a href="blog/2021/js-string.html">JS 字符串</a></li>
<li><a href="2022/dom-scripting.html">DOM Scripting</a></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org1617b62" class="outline-3">
<h3 id="org1617b62"><span class="section-number-3">5.6</span> 字符编码</h3>
<div class="outline-text-3" id="text-5-6">
<p>
UTF-8, UTF-16(JavaScript)
</p>
<ul class="org-ul">
<li><a href="https://web.archive.org/web/20210515223728/http://www.imkevinyang.com/2010/06/%E5%85%B3%E4%BA%8E%E5%AD%97%E7%AC%A6%E7%BC%96%E7%A0%81%EF%BC%8C%E4%BD%A0%E6%89%80%E9%9C%80%E8%A6%81%E7%9F%A5%E9%81%93%E7%9A%84.html">关于字符编码，你所需要知道的（ASCII,Unicode,Utf-8,GB2312…）</a></li>
<li><a href="https://www.joelonsoftware.com/2003/10/08/the-absolute-minimum-every-software-developer-absolutely-positively-must-know-about-unicode-and-character-sets-no-excuses/">The Absolute Minimum Every Software Developer Absolutely, Positively Must Know About Unicode and Character Sets (No Excuses!)</a></li>
<li><a href="https://mathiasbynens.be/notes/javascript-encoding">JavaScript’s internal character encoding: UCS-2 or UTF-16?</a></li>
</ul>
</div>
</div>

<div id="outline-container-org0763748" class="outline-3">
<h3 id="org0763748"><span class="section-number-3">5.7</span> Emacs</h3>
<div class="outline-text-3" id="text-5-7">
<ul class="org-ul">
<li><a href="2021/emacs-common-keyboard-shortcuts.html">Emacs 常用快捷键总结</a></li>
<li>Org Mode
<ul class="org-ul">
<li><a href="2021/bold-in-org-mode.html">Bold in Org-mode</a></li>
<li><a href="2021/org-mode-macro.html">使用 Org-mode 为文本添加高亮</a></li>
<li><a href="2021/org-mode-export-pdf.html">Emacs 下将 Org 导出为 pdf</a></li>
<li><a href="2022/org-mode-publish-with-crontab.html">自动发布 Org Mode</a></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orge739f1b" class="outline-3">
<h3 id="orge739f1b"><span class="section-number-3">5.8</span> VS Code</h3>
<div class="outline-text-3" id="text-5-8">
<ul class="org-ul">
<li><a href="https://code.visualstudio.com/shortcuts/keyboard-shortcuts-linux.pdf">Keyboard shortcuts for Linux - Visual Studio Code</a></li>
</ul>
</div>
</div>
<div id="outline-container-org3becdfb" class="outline-3">
<h3 id="org3becdfb"><span class="section-number-3">5.9</span> Git</h3>
<div class="outline-text-3" id="text-5-9">
<ul class="org-ul">
<li><a href="2021/git-credential.html">Git Credential</a></li>
<li><a href="2021/git-server-hook.html">云服务器配置 Git 仓库托管并使用 Git Hooks 自动执行脚本</a></li>
</ul>
</div>
</div>
